; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 328861 2 2 4 6 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared3 - mode
	spectrograph0 - mode
	image1 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 GroundStation3)
	(have_image Phenomenon6 infrared3)
	(have_image Star7 spectrograph0)
	(have_image Planet8 infrared3)
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 spectrograph2)
	(have_image Planet11 spectrograph2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (turn_to satellite1 star9 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star9)
   goals met: 0 of 8
4. (turn_to satellite0 planet8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet8)
   goals met: 0 of 8
5. (turn_to satellite0 groundstation3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 8
6. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 8
7. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 8
8. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 8
9. (turn_to satellite0 planet11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet11)
   goals met: 0 of 8
10. (turn_to satellite1 star9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star9)
   goals met: 0 of 8
11. (take_image satellite0 planet11 instrument0 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 1 of 8
12. (take_image satellite1 star9 instrument1 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 2 of 8
13. (turn_to satellite0 phenomenon10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 8
14. (turn_to satellite1 star7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star7)
   goals met: 2 of 8
15. (take_image satellite0 phenomenon10 instrument0 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 3 of 8
16. (take_image satellite1 star7 instrument1 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 4 of 8
17. (turn_to satellite0 groundstation4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation4)
   goals met: 5 of 8
18. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 5 of 8
19. (take_image satellite1 planet8 instrument1 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 6 of 8
20. (turn_to satellite0 phenomenon6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 8
21. (turn_to satellite1 groundstation3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation3)
   goals met: 6 of 8
22. (take_image satellite0 phenomenon6 instrument0 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 7 of 8
23. (turn_to satellite0 groundstation4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation4)
   goals met: 8 of 8
